[
    {
    "id": 1,
    "title": "The Hangover",
    "plot": "Two days before his wedding, Doug (Justin Bartha) and three friends (Bradley Cooper, Ed Helms, Zach Galifianakis) drive to Las Vegas for a wild and memorable stag party. In fact, when the three groomsmen wake up the next morning, they can't remember a thing; nor can they find Doug. With little time to spare, the three hazy pals try to re-trace their steps and find Doug so they can get him back to Los Angeles in time to walk down the aisle.",
    "genre": "Comedy",
    "poster_url": "https://i.pinimg.com/originals/7a/73/6d/7a736d1cd4bc02005c6381eefc34c1e1.jpg",
    "producer": "Todd Phillips",
    "year": "2009"
    },
    {
    "id": 2,
    "title": "Pet Sematary",
    "plot": "Dr. Louis Creed and his wife, Rachel, relocate from Boston to rural Maine with their two young children. The couple soon discover a mysterious burial ground hidden deep in the woods near their new home. When tragedy strikes, Louis turns to his neighbor Jud Crandall, setting off a perilous chain reaction that unleashes an unspeakable evil with horrific consequences. ",
    "genre": "Horror",
    "poster_url": "https://i.ebayimg.com/images/g/WYEAAOSwXHpcXQZt/s-l1600.jpg",
    "producer": "Lorenzo di Bonaventura",
    "year": "2019"
    },
    {
    "id": 3,
    "title": "Along Came A Spider",
    "plot": "A psychological suspense thriller adapted from James Patterson's first highly acclaimed novel in the Alex Cross series, Morgan Freeman reprises his role as the Washington, D.C. police detective and psychologist who is through playing mind games with criminals -- that is until a methodical predator, Gary Soneji (Michael Wincott) commits a daring kidnapping and lures Cross into the case.",
    "genre": "Suspense/Mystery",
    "poster_url": "https://m.media-amazon.com/images/I/816C2NET2jL._SX466_.jpg",
    "producer": "David Brown",
    "year": "2001"
    },
    {
    "id": 4,
    "title": "The Da Vinci Code",
    "plot": "A murder in Paris' Louvre Museum and cryptic clues in some of Leonardo da Vinci's most famous paintings lead to the discovery of a religious mystery. For 2,000 years a secret society closely guards information that -- should it come to light -- could rock the very foundations of Christianity.", 
    "genre": "Thriller",
    "poster_url": "https://m.media-amazon.com/images/I/91WkIF1lyXL._SY500_.jpg",
    "producer": "John Calley",
    "year": "2006"
    },
    {
    "id": 5,
    "title": "Dog",
    "plot": "DOG is a buddy comedy that follows the misadventures of two former Army Rangers paired against their will on the road trip of a lifetime. Army Ranger Briggs (Channing Tatum) and Lulu (a Belgian Malinois dog) buckle into a 1984 Ford Bronco and race down the Pacific Coast in hopes of making it to a fellow soldier's funeral on time. Along the way, they'll drive each other completely crazy, break a small handful of laws, narrowly evade death, and learn to let down their guards in order to have a fighting chance of finding happiness.",
    "genre": "Comedy",
    "poster_url": "https://images.bonanzastatic.com/afu/images/3687/7320/911a_10921479984/W_1754_.jpg",
    "producer": "Gregory Jacobs",
    "year": "2022"
    },
    {
    "id": 6,
    "title": "Black Panther",
    "plot": "After the death of his father, T'Challa returns home to the African nation of Wakanda to take his rightful place as king. When a powerful enemy suddenly reappears, T'Challa's mettle as king -- and as Black Panther -- gets tested when he's drawn into a conflict that puts the fate of Wakanda and the entire world at risk. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people.",
    "genre": "Action",
    "poster_url": "https://imageio.forbes.com/blogs-images/scottmendelson/files/2017/10/DMQuyI5V4AAUHP0.jpg?format=jpg&width=1200",
    "producer": "Kevin Feige",
    "year": "2018"
    },
    {
    "id": 7,
    "title": "Firestarter",
    "plot": "For more than a decade, parents Andy (Zac Efron; Extremely Wicked, Shockingly Evil and Vile; The Greatest Showman) and Vicky (Sydney Lemmon; Fear the Walking Dead, Succession) have been on the run, desperate to hide their daughter Charlie (Ryan Kiera Armstrong; American Horror Story: Double Feature, The Tomorrow War) from a shadowy federal agency that wants to harness her unprecedented gift for creating fire into a weapon of mass destruction. Andy has taught Charlie how to defuse her power, which is triggered by anger or pain. But as Charlie turns 11, the fire becomes harder and harder to control. After an incident reveals the family's location, a mysterious operative (Michael Greyeyes; Wild Indian, Rutherford Falls) is deployed to hunt down the family and seize Charlie once and for all. Charlie has other plans.",
    "genre": "Mystery/Thriller",
    "poster_url": "https://play-lh.googleusercontent.com/PN4CQSnBA8myD0Yebh13_rOvi-CcLv64g2zF2_jamml2b_8P6AEpd6QZrs8Aexd7f_FWnA7pEt1YAw=s400",
    "producer": "Jason Blum",
    "year": "2022"
    },
    {
    "id": 8,
    "title": "FoxHole",
    "plot": "Unfolding over the span of 36 hours in three separate wars--The American Civil War, World War I, and Iraq--Foxhole follows a small group of soldiers trapped in a confined space as they grapple with morality, futility, and an increasingly volatile combat situation.",
    "genre": "War/Drama",
    "poster_url": "https://s.movieinsider.com/images/p/600//636979_m1650724319.jpg",
    "producer": "Jack Fessenden",
    "year": "2022"
    },
    {
    "id": 9,
    "title": "Doctor Strange in the Multiverse of Madness",
    "plot": "In Marvel Studios Doctor Strange in the Multiverse of Madness the MCU unlocks the Multiverse and pushes its boundaries further than ever before. Journey into the unknown with Doctor Strange, who, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.",
    "genre": "Adventure/Action",
    "poster_url": "https://encrypted-tbn0.gstatic.com/shopping?q=tbn:ANd9GcSoKq_G6hev2Ffx7_wmXxTv2DidlzBCrXebFHmV1LfJKwChTRgGLV0g21umE5g&usqp=CAc",
    "producer": "Kevin Feige",
    "year": "2022"
    },
    {
    "id": 10,
    "title": "Memory",
    "plot": "MEMORY follows Alex Lewis (Liam Neeson), an expert assassin with a reputation for discreet precision. Caught in a moral quagmire, Alex refuses to complete a job that violates his code and must quickly hunt down and kill the people who hired him before they and FBI agent Vincent Serra (Guy Pearce) find him first. Alex is built for revenge but, with a memory that is beginning to falter, he is forced to question his every action, blurring the line between right and wrong.",
    "genre": "Drama/Mystery",
    "poster_url": "",
    "producer": "Cathy Schulman",
    "year": "2022"
    },
    {
    "id": 11,
    "title": "The Northman",
    "plot": "Prince Amleth is on the verge of becoming a man when his father is brutally murdered by his uncle, who kidnaps the boy's mother. Two decades later, Amleth is now a Viking who's on a mission to save his mother, kill his uncle and avenge his father.",
    "genre": "Adventure/Action",
    "poster_url": "https://preview.redd.it/ifzujk3cm1p81.jpg?auto=webp&s=5897bc004db8d9d1df2acfbf585d801e93bbafac", 
    "producer": "Robert Eggers",
    "year": "2022"
    },
    {
    "id": 12,
    "title": "Shark Bait",
    "plot": "A group of spring breakers are enjoying the trip of a lifetime on the sandy beaches of Mexico. As the sun rises after a night of partying, they steal a couple of jet skis and race out to sea. But bravado and bad decisions lead to a terrifying accident. Stranded miles from shore, the true horror begins when the group realizes they've drifted into shark-infested waters. With no way back and one friend badly bleeding, the group must quickly figure out how to survive the predator lurking in the waters below.",
    "genre": "Mystery",
    "poster_url": "https://i.ebayimg.com/images/g/4yIAAOSwnIRicJtv/s-l1600.jpg",
    "producer": "Nadine Luque",
    "year": "2022"
    },
    {
    "id": 13,
    "title": "Happening",
    "plot": "France, 1963. Anne is a bright young student with a promising future ahead of her. But when she falls pregnant, she sees the opportunity to finish her studies and escape the constraints of her social background disappearing. With her final exams fast approaching and her belly growing, Anne resolves to act, even if she has to confront shame and pain, even if she must risk prison to do so..",
    "genre": "Drama",
    "poster_url": "https://m.media-amazon.com/images/M/MV5BOWQyZjY0MGMtN2Y5Mi00Y2Q2LWE4MWQtNWI5ODc1NDEzNmRhXkEyXkFqcGdeQXVyMjY3NDMzMzU@._V1_.jpg",
    "producer": "Alice Girard",
    "year": "2022"
    }
  
    ]